# CannotPlaceAreaReininforcementWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..CannotPlaceAreaReininforcementWarn Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Can't find a host for Area Reinforcement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPlaceAreaReininforcementWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPlaceAreaReininforcementWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPlaceAreaReininforcementWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace